% lab1_full.m
% Ввод данных из Таблицы 1
Tab = [
    5.458056, 121935.9, 120000.0, 0.1257982;
    4.717562, 120179.1, 120000.0, 0.4852207;
    3.911148, 121619.1, 120000.0, 0.1948820;
    3.574879, 120796.0, 120000.0, 0.3003445;
    3.558563, 121753.3, 120000.0, 0.2090244
];

dt = Tab(:,1);   % Δt
P1 = Tab(:,2);   % Давление на входе
P2 = Tab(:,3);   % Давление на выходе
Mu = Tab(:,4);   % Коэффициент расхода
F  = 7.85e-4;    % м²
I  = 2;          % А
U  = 18;         % В
Ro = 1.29;       % кг/м³

m = Mu .* F .* sqrt(2 * Ro .* (P1 - P2));

Q = U * I;  

Cp = Q ./ (m .* dt);

Cpsr = trapz(m, Cp) / (m(end) - m(1));

Rezult = [Tab, Cp];
disp(Rezult);
fprintf('Среднемассовая теплоёмкость Cpsr = %.2f Дж/(кг·К)\n', Cpsr);

